snlkuharlocal/src/DataProcessors/ФормированиеАТК/ФормированиеАТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеАТК</name>
  <attributes>
    <name>Машина</name>
    <type>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаОтчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераАТК</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерАТК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_ЧЗ/СтатусыКМ_ЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_ЧЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиИСМП</types>
    </type>
  </resources>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыОперацийИСМП/ВидыОперацийИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийИСМП</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот_Импорт</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот_МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_БезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ВозвратФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ДистанционнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Прочее</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ИспользованиеДляСобственныхНужд</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Конфискация</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоГосударственномуКонтракту</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоОбразцам</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_РозничнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Уничтожение</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Утилизация</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Утрата</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ДистанционнаяПродажа</name>
    <comment>Возврат при дистанционном способе продажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ИспользованиеДляПроизводственныхЦелей</name>
    <comment>Возврат товара, выведенного изоборота  для  производственных целей</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ИспользованиеДляСобственныхНужд</name>
    <comment>Возврат товара, выведенного из оборота для собственных нужд</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи</name>
    <comment>Возврат в оборот возврат приобретение не для перепродажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ПродажаЧерезВендинг</name>
    <comment>Возврат товара, выведенного из оборота для продажи  через  вендинговый аппарат</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_РозничнаяРеализация</name>
    <comment>Возврат при розничной реализации</comment>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
    <comment>Отгрузка в ЕАЭС</comment>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Испорчен</name>
    <comment>Списание не нанесееных КМ. Испорчен.</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Уничтожен</name>
    <comment>Списание не нанесееных КМ. Уничтожен.</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Утерян</name>
    <comment>Списание не нанесееных КМ. Утерян.</comment>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратБезКМ</name>
    <comment>RETAIL_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратБезКМ_ДистПродажи</name>
    <comment>REMOTE_SALE_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратОтКонечногоПокупателя</name>
    <comment>LEGAL_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратРанееЭкспортированногоЕАЭС</name>
    <comment>EEC_EXPORT_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ИспорченоЛибоУтеряно</name>
    <comment>KM_SPOILED</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки_Изъятие</name>
    <comment>REMOVING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки_Добавление</name>
    <comment>ADDING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК_Добавление</name>
    <comment>ADDING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК_Изъятие</name>
    <comment>REMOVING</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиИСМП/СтатусыКодовМаркировкиИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиИСМП</name>
  <enumValues>
    <name>Эмитирован</name>
    <comment>EMITTED</comment>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
    <comment>APPLIED</comment>
  </enumValues>
  <enumValues>
    <name>ВведенВОборот</name>
    <comment>INTRODUCED</comment>
  </enumValues>
  <enumValues>
    <name>ВведенВОборотПриВозврате</name>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_РозничнаяПродажа</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ЭкспортВСтраныЕАЭС</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ЭкспортЗаПределыСтранЕАЭС</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ВозвратФЛ</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_УтратаИлиПовреждении</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_Уничтожен</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_Конфискация</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ИспользованиеДляСобственныхНужд</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ПоДоговоруРассрочки</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_Перемаркировка</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_Списание</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_БезвозмезднаяПередача</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ПриобретениеГосПредприятием</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ДистанционнаяПродажа</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
    <comment>DISAGGREGATION</comment>
  </enumValues>
  <enumValues>
    <name>ОжидаетДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПовторнойМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПередачуСобственнику</name>
  </enumValues>
  <enumValues>
    <name>ОтрицательноеРешениеФТС</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодтверждениеФТС</name>
  </enumValues>
  <enumValues>
    <name>НаКонтролеФТС</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
    <comment>WRITTEN_OFF</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ПланФакт/ПланФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПланФакт</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>ПланКорректировка</name>
  </enumValues>
  <enumValues>
    <name>БизнесПлан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ФормированиеАТК/ObjectModule.bsl
Функция Создать_ЗапросыНаАТК_МАШ(МАШ_Ссылка, Знач ДопПараметры = Неопределено) Экспорт
	Результат 			= МаркировкаКС.СтруктураРезультата(Ложь);
	
	ВидОперацииИСМП		= Перечисления.ВидыОперацийИСМП.АТК;     
	
	Если ТипЗнч(ДопПараметры) <> Тип("Структура") Тогда
		ДопПараметры = Новый Структура;	
	КонецЕсли;
	
	ЧислоКодовВПорции	= 90000;
	НомерДокумента		= 1;	
	
	рОчистки 			= Документы.МаркировкаТоваровИСМП.ОчиститьПодчиненныеДокументыМаркировки(МАШ_Ссылка, Перечисления.ВидыОперацийИСМП.АТК);	
	
	Если рОчистки.Успешно Тогда
		СуществующиеДокументы	= рОчистки.СуществующиеДокументы;		
		
		ДопПараметры.Вставить("ДлиннаКодаТНВЭД", 10); // Кухарь А.Ю.  28.08.2024 - полный код ТНВЭД
		рЗапроса				= Получить_КодыМаркировкиМАШ_ДляАТК(МАШ_Ссылка, ДопПараметры); 
		
		Выборка_ПорядковыйНомерАТК = рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПорядковыйНомерАТК");
		Если Выборка_ПорядковыйНомерАТК.Количество() = 0 Тогда
			Результат.Ошибки.Добавить("Не найдены КМ к МАШ " + МАШ_Ссылка + " !");
		КонецЕсли;
		
		Пока Выборка_ПорядковыйНомерАТК.Следующий() Цикл			
			Выборка_ТНВЭД = Выборка_ПорядковыйНомерАТК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТНВЭД_Группа");		
			
			Пока Выборка_ТНВЭД.Следующий() Цикл
				ДокОбъект = Неопределено;			
				ОсновнойДокумент = Документы.МаркировкаТоваровИСМП.ПустаяСсылка();
				
				Выборка = Выборка_ТНВЭД.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ДокОбъект = Неопределено Тогда
						ДокОбъект			= ПолучитьСоздатьДокМаркировки(МАШ_Ссылка, СуществующиеДокументы, НомерДокумента, ВидОперацииИСМП);
						ДокОбъект.ТНВЭД 	= Справочники.ТНВЭД.НайтиПоКоду(Выборка_ТНВЭД.ТНВЭД_Группа);
						
						ДокОбъект.Комментарий = "Порядковый № АТК: " + Выборка_ПорядковыйНомерАТК.ПорядковыйНомерАТК;
					КонецЕсли;
					
					Если Выборка.КМ_Штука_Наименование = Null Тогда Продолжить КонецЕсли;
					
					СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();
					СтрокаТЧ.ШтрихкодУпаковки	= Выборка.КМ_Штука;
					
					Если ДокОбъект.ШтрихкодыУпаковок.Количество() >= ЧислоКодовВПорции Тогда
						рПроведения = ПровестиДокумент(ДокОбъект);
						Если НЕ рПроведения.Успешно Тогда
							МаркировкаКС.ДобавитьОшибки(Результат, рПроведения);					
						КонецЕсли; 
						
						Если НЕ ЗначениеЗаполнено(ОсновнойДокумент) И ТипЗнч(ДокОбъект.ДокументОснование) <> Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда
							ОсновнойДокумент = ДокОбъект.Ссылка;					
						КонецЕсли; 
						
						НомерДокумента	= НомерДокумента + 1;
						
						ДокОбъект		= ПолучитьСоздатьДокМаркировки(МАШ_Ссылка, СуществующиеДокументы, НомерДокумента, ВидОперацииИСМП);
						ДокОбъект.ТНВЭД	= Справочники.ТНВЭД.НайтиПоКоду(Выборка_ТНВЭД.ТНВЭД_Группа);
						ДокОбъект.Комментарий = "Порядковый № АТК: " + Выборка_ПорядковыйНомерАТК.ПорядковыйНомерАТК;
						
						ДокОбъект.ДокументОснование = ОсновнойДокумент; 				
					КонецЕсли; 
				КонецЦикла;			
				
				Если ДокОбъект<>Неопределено И ДокОбъект.ШтрихкодыУпаковок.Количество()>0 Тогда
					рПроведения = ПровестиДокумент(ДокОбъект);
					Если НЕ рПроведения.Успешно Тогда
						МаркировкаКС.ДобавитьОшибки(Результат, рПроведения);					
					КонецЕсли;									
					
					НомерДокумента	= НомерДокумента + 1;				
				КонецЕсли;				
			КонецЦикла;		
		КонецЦикла;	
	Иначе
		Результат.Успешно = Ложь;
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
		
		Возврат Результат;
	КонецЕсли;
	
	Результат.ОбработаноОбъектов = НомерДокумента - 1;
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов>0);
	
	Возврат Результат;	
КонецФункции //СоздатьАгрегацииКЗПС(ЗПС_Ссылка)

Функция ПровестиДокумент(ДокОбъект)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ДокОбъект.ПометкаУдаления = Ложь;				  
				
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение                                              
		ДокОбъект.Записать();
		
		ТекстОшибки = СтрШаблон("Не удалось провести документ: %1. Причина: %2.", ДокОбъект.Ссылка, ОписаниеОшибки());
		
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить(ТекстОшибки);						
	КонецПопытки;
	
	Возврат Результат;
КонецФункции // ()

Функция ПолучитьСоздатьДокМаркировки(ДокОснование, СуществующиеДокументы, Сч, ВидОперацииИСМП, Основной = Истина) Экспорт
	ДокСсылка = СуществующиеДокументы[Сч];					
	Если ДокСсылка = Неопределено Тогда
		ДокОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();
			
		ДокОбъект.Дата	= ТекущаяДата();
		
		ДокОбъект.Организация	= ПолучитьРеквизитШапки(ДокОснование, "Организация");
		ДокОбъект.ДополнительныеСвойства.Вставить("ЗаполнятьТолькоШапку", Истина);
		ДокОбъект.Заполнить(ДокОснование);
	Иначе
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		ДокОбъект.Организация		= ПолучитьРеквизитШапки(ДокОснование, "Организация");
		ДокОбъект.ДокументОснование	= ДокОснование; //Хвосты иногда не видны если прицеплены не к тому основанию
	КонецЕсли;
	
	ДокОбъект.ВидОперации		= Перечисления.ВидыОперацийИСМП.ВидОперацииМаркировки(ВидОперацииИСМП);
	ДокОбъект.ВидОперацииИСМП 	= ВидОперацииИСМП;
	
	ДокОбъект.Товары.Очистить();
	ДокОбъект.ШтрихкодыУпаковок.Очистить();
	
	Возврат ДокОбъект;
КонецФункции //ПолучитьСоздатьАгрегацию(ДокОснование, СуществующиеДокументы, Сч)

Функция Получить_КодыМаркировкиМАШ_ДляАТК(МАШ_Ссылка, ДопПараметры = Неопределено)
	ДлиннаКодаТНВЭД = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ДлиннаКодаТНВЭД", 4);
	мНомераАТК		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "НомераАТК");
	ТаблицаШК 		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ТаблицаШК");
	
	Если НЕ ЗначениеЗаполнено(ТаблицаШК) Тогда
		ТаблицаШК = ПолучитьКодыПоМашине(МАШ_Ссылка);
	КонецЕсли;
	
	Если мНомераАТК = Неопределено Тогда
		мНомераАТК = Новый ТаблицаЗначений;
		мНомераАТК.Колонки.Добавить("Номенклатура", 		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		мНомераАТК.Колонки.Добавить("ПорядковыйНомерАТК",	ПолучитьОписаниеТиповЧисла(2));
	КонецЕсли;
	
	Запрос	= Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_НомераАТК ИЗ &НомераАТК КАК НомераАТК ИНДЕКСИРОВАТЬ ПО Номенклатура 
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Номенклатура
	|ПОМЕСТИТЬ ВТ_НоменклатураЗПС	 
	|ИЗ 
	|	Документ.ЗаказПоставщику.Товары КАК ТоварыЗПС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ	
	|	Документ.Машина.Заказы КАК ЗаказыМашины
	|ПО
	|	ЗаказыМашины.Заказ = ТоварыЗПС.Ссылка	
	|ГДЕ 
	|	ЗаказыМашины.Ссылка = &МАШ_Ссылка
	|;
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ШК ИЗ &ТаблицаШК КАК ТаблицаШК
	|;
	|ВЫБРАТЬ	
	|	IsNULL(ВТ_НомераАТК.ПорядковыйНомерАТК,0)			КАК ПорядковыйНомерАТК,
	|	ПОДСТРОКА(ВТ_ШК.Владелец.Родитель.ТНВЭД.Код,
	|		1," + ДлиннаКодаТНВЭД + ")						КАК ТНВЭД_Группа,
	|	ВТ_ШК.Владелец.Родитель.ТНВЭД						КАК КодТНВЭД,
	|	ВТ_ШК.Владелец.Родитель 							КАК Модель,
	|	ВТ_ШК.Владелец.Родитель.Код							КАК Модель_Код,
	|
	|	ВТ_ШК.Владелец 										КАК Номенклатура,
	|	ВТ_ШК.Владелец.Родитель.СтавкаНДС					КАК СтавкаНДС,
	|	ВТ_ШК.Ссылка 										КАК КМ_Штука,
	|	ВТ_ШК.Ссылка.Наименование 							КАК КМ_Штука_Наименование,
	|	
	|	СтатусыКМ_ЧЗ.Статус									КАК Статус
	|ИЗ
	|	ВТ_ШК
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыКМ_ЧЗ.СрезПоследних(&ДатаДок, ШтрихКодУпаковки В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка ИЗ ВТ_ШК)) КАК СтатусыКМ_ЧЗ
	|ПО
	|	ВТ_ШК.Ссылка = СтатусыКМ_ЧЗ.ШтрихКодУпаковки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_НомераАТК
	|ПО
	|	ВТ_НомераАТК.Номенклатура = ВТ_ШК.Владелец
	|ГДЕ
	|	СтатусыКМ_ЧЗ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован)
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ШК.Владелец,
	|	ВТ_ШК.Наименование
	|ИТОГИ 
	|	КОЛИЧЕСТВО(Различные КМ_Штука)	
	|ПО
	|	ПорядковыйНомерАТК,
	|	ТНВЭД_Группа,	
	|	СтавкаНДС,
	|	Модель	
	|";
	
	Запрос.УстановитьПараметр("МАШ_Ссылка", МАШ_Ссылка);
	Запрос.УстановитьПараметр("ТаблицаШК",	ТаблицаШК);
	Запрос.УстановитьПараметр("ДатаДок", 	ПолучитьРеквизитШапки(МАШ_Ссылка, "Дата", "Документ"));
	Запрос.УстановитьПараметр("НомераАТК",  мНомераАТК);
	
	Возврат Запрос.Выполнить();
КонецФункции //Получить_КодыМаркировкиМАШ_ДляАТК(МАШ_Ссылка)

Функция ПолучитьКодыПоМашине(МАШ_Ссылка)	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки				КАК Ссылка,
	|	ШтрихКодУпаковки.Владелец		КАК Владелец,
	|	ШтрихКодУпаковки.Наименование	КАК Наименование	
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихКодыУпаковок	
	|ГДЕ
	|	Ссылка.ДокОснование В (ВЫБРАТЬ РАЗЛИЧНЫЕ Заказ ИЗ Документ.Машина.Заказы ГДЕ Ссылка = &МАШ_Ссылка)
	|	И Ссылка.ПланФакт = ЗНАЧЕНИЕ(Перечисление.ПланФакт.Факт)
	|	И Ссылка.Проведен		
	|	И ШтрихКодУпаковки.ТипКода 	= ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар)	
	|	И ШтрихКодУпаковки.Владелец В (ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ ВТ_НоменклатураЗПС)
	//++Данилова Е.В. 25.06.2025  MARK-2484 
	//|	И НЕ ШтрихКодУпаковки.Владелец.Родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект) 
	//--Данилова Е.В. 25.06.2025
	|";
	
	Запрос.УстановитьПараметр("МАШ_Ссылка", МАШ_Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ()

Функция ПолучитьКодыПоСписку(СписокШК)
	СписокШК = МаркировкаКС.ПолучитьЗначениеПараметра(СписокШК);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка,
	|	Владелец,
	|	Наименование
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	Ссылка В (&СписокШК)	
	|";	
	
	Запрос.УстановитьПараметр("СписокШК", СписокШК);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьКодыПоСписку(СписокШК)
